log/benchmark/jruby_9_2_6_0_indy.log
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 12
+ JAVA_HOME=/opt/jdk-11.0.2
+ JRUBY_OPTS=-Xcompile.invokedynamic=true
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +indy +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
apr_pollset_poll: The timeout specified has expired (70007)
+ ab -n 1000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
apr_pollset_poll: The timeout specified has expired (70007)
+ pkill -9 java
+ sleep 5
/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/jruby.bash: line 452: 15744 Killed                  "$JAVACMD" $PROFILE_ARGS $JAVA_OPTS "$JFFI_OPTS" "${java_args[@]}" ${classmod_flag} "$JRUBY_CP$CP_DELIMITER$CP$CP_DELIMITER$CLASSPATH" "-Djruby.home=$JRUBY_HOME" "-Djruby.lib=$JRUBY_HOME/lib" -Djruby.script=jruby "-Djruby.shell=$JRUBY_SHELL" $java_class $mode "$@"
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 12
+ JAVA_HOME=/opt/jdk-11.0.2
+ JRUBY_OPTS=-Xcompile.invokedynamic=true
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +indy +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts.json
Document Length:        39548 bytes

Concurrency Level:      4
Time taken for tests:   84.463 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      399970000 bytes
HTML transferred:       395480000 bytes
Requests per second:    118.40 [#/sec] (mean)
Time per request:       33.785 [ms] (mean)
Time per request:       8.446 [ms] (mean, across all concurrent requests)
Transfer rate:          4624.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:    20   34  45.6     27    1591
Waiting:       20   33  45.2     27    1580
Total:         20   34  45.6     27    1591

Percentage of the requests served within a certain time (ms)
  50%     27
  66%     31
  75%     34
  80%     36
  90%     41
  95%     45
  98%     79
  99%    106
 100%   1591 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts.json
Document Length:        39548 bytes

Concurrency Level:      4
Time taken for tests:   5.934 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      39997000 bytes
HTML transferred:       39548000 bytes
Requests per second:    168.53 [#/sec] (mean)
Time per request:       23.735 [ms] (mean)
Time per request:       5.934 [ms] (mean, across all concurrent requests)
Transfer rate:          6582.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    20   24   4.6     21      45
Waiting:       20   23   4.6     21      45
Total:         20   24   4.6     21      45

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     23
  75%     26
  80%     28
  90%     31
  95%     32
  98%     35
  99%     38
 100%     45 (longest request)
+ pkill -9 java
+ sleep 5
/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/jruby.bash: line 452: 16407 Killed                  "$JAVACMD" $PROFILE_ARGS $JAVA_OPTS "$JFFI_OPTS" "${java_args[@]}" ${classmod_flag} "$JRUBY_CP$CP_DELIMITER$CP$CP_DELIMITER$CLASSPATH" "-Djruby.home=$JRUBY_HOME" "-Djruby.lib=$JRUBY_HOME/lib" -Djruby.script=jruby "-Djruby.shell=$JRUBY_SHELL" $java_class $mode "$@"
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 12
+ JAVA_HOME=/opt/jdk-11.0.2
+ JRUBY_OPTS=-Xcompile.invokedynamic=true
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +indy +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
apr_pollset_poll: The timeout specified has expired (70007)
+ ab -n 1000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
apr_pollset_poll: The timeout specified has expired (70007)
+ pkill -9 java
+ sleep 5
/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/jruby.bash: line 452: 17301 Killed                  "$JAVACMD" $PROFILE_ARGS $JAVA_OPTS "$JFFI_OPTS" "${java_args[@]}" ${classmod_flag} "$JRUBY_CP$CP_DELIMITER$CP$CP_DELIMITER$CLASSPATH" "-Djruby.home=$JRUBY_HOME" "-Djruby.lib=$JRUBY_HOME/lib" -Djruby.script=jruby "-Djruby.shell=$JRUBY_SHELL" $java_class $mode "$@"
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 12
+ JAVA_HOME=/opt/jdk-11.0.2
+ JRUBY_OPTS=-Xcompile.invokedynamic=true
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +indy +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts/1.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1.json
Document Length:        279 bytes

Concurrency Level:      4
Time taken for tests:   30.050 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      7280000 bytes
HTML transferred:       2790000 bytes
Requests per second:    332.78 [#/sec] (mean)
Time per request:       12.020 [ms] (mean)
Time per request:       3.005 [ms] (mean, across all concurrent requests)
Transfer rate:          236.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     5   12  19.1      9     724
Waiting:        5   11  18.6      8     720
Total:          5   12  19.1      9     724

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     11
  75%     13
  80%     16
  90%     19
  95%     21
  98%     25
  99%     34
 100%    724 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts/1.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1.json
Document Length:        279 bytes

Concurrency Level:      4
Time taken for tests:   1.833 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      728000 bytes
HTML transferred:       279000 bytes
Requests per second:    545.47 [#/sec] (mean)
Time per request:       7.333 [ms] (mean)
Time per request:       1.833 [ms] (mean, across all concurrent requests)
Transfer rate:          387.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     5    7   2.2      6      20
Waiting:        5    7   2.1      6      19
Total:          5    7   2.2      7      20

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      7
  75%      8
  80%      9
  90%     11
  95%     11
  98%     13
  99%     16
 100%     20 (longest request)


#
# 2nd attempt
#
+ JAVA_HOME=/opt/jdk-11.0.2
+ JRUBY_OPTS=-Xcompile.invokedynamic=true
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +indy +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts
Document Length:        52719 bytes

Concurrency Level:      4
Time taken for tests:   61.142 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      534224610 bytes
HTML transferred:       527190000 bytes
Requests per second:    163.55 [#/sec] (mean)
Time per request:       24.457 [ms] (mean)
Time per request:       6.114 [ms] (mean, across all concurrent requests)
Transfer rate:          8532.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:    11   24  31.3     21    1056
Waiting:       11   24  30.7     20    1045
Total:         11   24  31.3     21    1056

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     24
  75%     26
  80%     28
  90%     32
  95%     36
  98%     57
  99%     79
 100%   1056 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts
Document Length:        52719 bytes

Concurrency Level:      4
Time taken for tests:   3.864 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      53422306 bytes
HTML transferred:       52719000 bytes
Requests per second:    258.81 [#/sec] (mean)
Time per request:       15.455 [ms] (mean)
Time per request:       3.864 [ms] (mean, across all concurrent requests)
Transfer rate:          13502.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    10   15   4.2     13      35
Waiting:       10   15   4.1     13      34
Total:         10   15   4.2     13      35

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     18
  75%     19
  80%     19
  90%     20
  95%     22
  98%     26
  99%     28
 100%     35 (longest request)


#
# 3rd attempt
#
+ JAVA_HOME=/opt/jdk-11.0.2
+ JRUBY_OPTS=-Xcompile.invokedynamic=true
+ jruby.bash -v /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec /home/k0kubun/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +indy +jit [linux-x86_64]
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.jruby.ext.openssl.SecurityHelper (file:/home/k0kubun/.rbenv/versions/jruby-9.2.6.0/lib/ruby/stdlib/jopenssl.jar) to constructor java.security.cert.CertificateFactory(java.security.cert.CertificateFactorySpi,java.security.Provider,java.lang.String)
WARNING: Please consider reporting this to the maintainers of org.jruby.ext.openssl.SecurityHelper
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Puma starting in single mode...
* Version 3.12.0 (jruby 9.2.6.0 - ruby 2.5.3), codename: Llamas in Pajamas
* Min threads: 4, max threads: 4
* Environment: production
[bootsnap/setup] Load path caching is not supported on this implementation of Ruby
[bootsnap/setup] bytecode caching is not supported on this implementation of Ruby
[bootsnap/setup] YAML parsing caching is not supported on this implementation of Ruby
* Listening on tcp://0.0.0.0:3000
Use Ctrl-C to stop
+ ab -n 10000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1
Document Length:        929 bytes

Concurrency Level:      4
Time taken for tests:   32.502 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      16324754 bytes
HTML transferred:       9290000 bytes
Requests per second:    307.67 [#/sec] (mean)
Time per request:       13.001 [ms] (mean)
Time per request:       3.250 [ms] (mean, across all concurrent requests)
Transfer rate:          490.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     6   13  19.4      9     711
Waiting:        6   12  19.0      9     703
Total:          6   13  19.4      9     711

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     11
  75%     15
  80%     17
  90%     21
  95%     23
  98%     27
  99%     36
 100%    711 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1
Document Length:        929 bytes

Concurrency Level:      4
Time taken for tests:   2.111 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1632262 bytes
HTML transferred:       929000 bytes
Requests per second:    473.73 [#/sec] (mean)
Time per request:       8.444 [ms] (mean)
Time per request:       2.111 [ms] (mean, across all concurrent requests)
Transfer rate:          755.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     5    8   3.5      7      46
Waiting:        5    8   3.4      7      46
Total:          5    8   3.5      7      46

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      9
  80%     10
  90%     12
  95%     14
  98%     18
  99%     19
 100%     46 (longest request)